1c/src/Reports/ПосещаемостьКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ПосещаемостьКлиентов</Name>
			<Comment>Отчёт по посещениям клиентов фитнес-центра за период</Comment>
		</Properties>
	</Report>
</MetaDataObject>

1c/src/Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Посещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПосещенияКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАбонементов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/Reports/ПосещаемостьКлиентов/Forms/ФормаОтчета/Ext/Form.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(ТекущаяДата());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПринтФормы = "Посещаемость клиентов";

	// Запрос посещений с группировкой по клиенту
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| Посещение.Клиент.Наименование КАК Клиент,
	| Посещение.Клиент.Телефон КАК Телефон,
	| Посещение.Занятие.Наименование КАК Занятие,
	| Посещение.Дата КАК Дата,
	| Посещение.ВремяПосещения КАК ВремяПосещения,
	| Посещение.Номер КАК Номер
	|ИЗ
	| Документ.Посещение КАК Посещение
	|ГДЕ
	| НЕ Посещение.ПометкаУдаления
	| И Посещение.Дата >= &НачалоПериода
	| И Посещение.Дата <= &КонецПериода
	|УПОРЯДОЧИТЬ ПО
	| Посещение.Клиент.Наименование,
	| Посещение.Дата";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	// Запрос итоговой статистики по клиентам
	ЗапросСтат = Новый Запрос;
	ЗапросСтат.Текст =
	"ВЫБРАТЬ
	| Посещение.Клиент.Наименование КАК Клиент,
	| КОЛИЧЕСТВО(Посещение.Ссылка) КАК КолПосещений
	|ИЗ
	| Документ.Посещение КАК Посещение
	|ГДЕ
	| НЕ Посещение.ПометкаУдаления
	| И Посещение.Дата >= &НачалоПериода
	| И Посещение.Дата <= &КонецПериода
	|СГРУППИРОВАТЬ ПО
	| Посещение.Клиент.Наименование
	|УПОРЯДОЧИТЬ ПО
	| КолПосещений УБЫВ";

	ЗапросСтат.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросСтат.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	// Заголовок отчёта
	НомСтр = 1;
	ТабДок.Область(НомСтр, 1, НомСтр, 6).Объединить();
	ТабДок.Область(НомСтр, 1).Текст = "Посещаемость клиентов: "
		+ Формат(НачалоПериода, "ДЛФ=D") + " — " + Формат(КонецПериода, "ДЛФ=D");
	ТабДок.Область(НомСтр, 1).Шрифт = Новый Шрифт(, 13, Истина);
	ТабДок.Область(НомСтр, 1).ЦветФона = WebЦвета.СветлоСерый;
	ТабДок.Область(НомСтр, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;

	// Раздел 1: Детальный журнал посещений
	НомСтр = НомСтр + 2;
	ТабДок.Область(НомСтр, 1, НомСтр, 6).Объединить();
	ТабДок.Область(НомСтр, 1).Текст = "Журнал посещений";
	ТабДок.Область(НомСтр, 1).Шрифт = Новый Шрифт(, 11, Истина);

	НомСтр = НомСтр + 1;
	МассивЗаголовков = Новый Массив;
	МассивЗаголовков.Добавить("№");
	МассивЗаголовков.Добавить("Дата");
	МассивЗаголовков.Добавить("Клиент");
	МассивЗаголовков.Добавить("Телефон");
	МассивЗаголовков.Добавить("Занятие");
	МассивЗаголовков.Добавить("Время посещения");

	Для Инд = 0 По МассивЗаголовков.ВГраница() Цикл
		ТабДок.Область(НомСтр, Инд + 1).Текст = МассивЗаголовков[Инд];
		ТабДок.Область(НомСтр, Инд + 1).ЦветФона = WebЦвета.СтальноЙСиний;
		ТабДок.Область(НомСтр, Инд + 1).ЦветТекста = WebЦвета.Белый;
		ТабДок.Область(НомСтр, Инд + 1).Шрифт = Новый Шрифт(, , Истина);
		ТабДок.Область(НомСтр, Инд + 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;

	Выборка = Запрос.Выполнить().Выбрать();
	ИтогоПосещений = 0;
	Пока Выборка.Следующий() Цикл
		НомСтр = НомСтр + 1;
		ИтогоПосещений = ИтогоПосещений + 1;
		ТабДок.Область(НомСтр, 1).Текст = Выборка.Номер;
		ТабДок.Область(НомСтр, 2).Текст = Формат(Выборка.Дата, "ДЛФ=D");
		ТабДок.Область(НомСтр, 3).Текст = Выборка.Клиент;
		ТабДок.Область(НомСтр, 4).Текст = Выборка.Телефон;
		ТабДок.Область(НомСтр, 5).Текст = Выборка.Занятие;
		ТабДок.Область(НомСтр, 6).Текст = Формат(Выборка.ВремяПосещения, "ДЛФ=T");

		Если НомСтр % 2 = 0 Тогда
			Для Кол = 1 По 6 Цикл
				ТабДок.Область(НомСтр, Кол).ЦветФона = WebЦвета.АлисаСиний;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	// Итого по журналу
	НомСтр = НомСтр + 1;
	ТабДок.Область(НомСтр, 1, НомСтр, 5).Объединить();
	ТабДок.Область(НомСтр, 1).Текст = "Всего посещений за период:";
	ТабДок.Область(НомСтр, 1).Шрифт = Новый Шрифт(, , Истина);
	ТабДок.Область(НомСтр, 1).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ТабДок.Область(НомСтр, 6).Текст = ИтогоПосещений;
	ТабДок.Область(НомСтр, 6).Шрифт = Новый Шрифт(, , Истина);
	ТабДок.Область(НомСтр, 6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Для Кол = 1 По 6 Цикл
		ТабДок.Область(НомСтр, Кол).ЦветФона = WebЦвета.ЗолотоЙ;
	КонецЦикла;

	// Раздел 2: Рейтинг клиентов по посещаемости
	НомСтр = НомСтр + 2;
	ТабДок.Область(НомСтр, 1, НомСтр, 3).Объединить();
	ТабДок.Область(НомСтр, 1).Текст = "Рейтинг клиентов по посещаемости";
	ТабДок.Область(НомСтр, 1).Шрифт = Новый Шрифт(, 11, Истина);

	НомСтр = НомСтр + 1;
	ТабДок.Область(НомСтр, 1).Текст = "Клиент";
	ТабДок.Область(НомСтр, 2).Текст = "Кол-во посещений";
	Для Кол = 1 По 2 Цикл
		ТабДок.Область(НомСтр, Кол).ЦветФона = WebЦвета.СтальноЙСиний;
		ТабДок.Область(НомСтр, Кол).ЦветТекста = WebЦвета.Белый;
		ТабДок.Область(НомСтр, Кол).Шрифт = Новый Шрифт(, , Истина);
		ТабДок.Область(НомСтр, Кол).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;

	ВыборкаСтат = ЗапросСтат.Выполнить().Выбрать();
	Место = 0;
	Пока ВыборкаСтат.Следующий() Цикл
		НомСтр = НомСтр + 1;
		Место = Место + 1;
		ТабДок.Область(НомСтр, 1).Текст = Место + ". " + ВыборкаСтат.Клиент;
		ТабДок.Область(НомСтр, 2).Текст = ВыборкаСтат.КолПосещений;
		ТабДок.Область(НомСтр, 2).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;

		Если Место = 1 Тогда
			ТабДок.Область(НомСтр, 1).ЦветФона = WebЦвета.ЗолотоЙ;
			ТабДок.Область(НомСтр, 2).ЦветФона = WebЦвета.ЗолотоЙ;
		ИначеЕсли Место = 2 Тогда
			ТабДок.Область(НомСтр, 1).ЦветФона = WebЦвета.СветлоСерый;
			ТабДок.Область(НомСтр, 2).ЦветФона = WebЦвета.СветлоСерый;
		ИначеЕсли Место = 3 Тогда
			ТабДок.Область(НомСтр, 1).ЦветФона = WebЦвета.ПерсиковоЙ;
			ТабДок.Область(НомСтр, 2).ЦветФона = WebЦвета.ПерсиковоЙ;
		КонецЕсли;
	КонецЦикла;

	ТабДок.АвтоШиринаКолонок = Истина;
	ТабличныйДокумент = ТабДок;

КонецПроцедуры

#КонецОбласти
